{
  "Extraversion": "You are outgoing and energized by social interactions. You enjoy being around people and tend to be talkative and assertive.",
  "Introversion": "You are reserved and prefer solitude. You recharge by spending time alone and tend to be thoughtful and reflective.",
  "Sensing": "You focus on concrete facts and details. You prefer practical, hands-on approaches and trust your five senses.",
  "Intuition": "You focus on possibilities and patterns. You enjoy abstract thinking and trust your gut instincts.",
  "Thinking": "You make decisions based on logic and objective analysis. You value fairness and consistency.",
  "Feeling": "You make decisions based on values and how they affect people. You value harmony and compassion.",
  "Judging": "You prefer structure and planning. You like to have things decided and organized.",
  "Perceiving": "You prefer flexibility and spontaneity. You like to keep options open and adapt to situations.",
  "Openness": "You are curious and open to new experiences. You enjoy creativity and unconventional ideas.",
  "Conscientiousness": "You are organized and responsible. You set goals and work systematically to achieve them.",
  "Agreeableness": "You are cooperative and trusting. You value getting along with others and helping people.",
  "Neuroticism": "You tend to experience negative emotions. You may worry more and be more sensitive to stress.",
  "Realistic": "You enjoy working with things and tools. You prefer practical, hands-on activities.",
  "Investigative": "You enjoy solving problems and learning. You like scientific and analytical work.",
  "Artistic": "You enjoy creative expression. You value originality and aesthetic experiences.",
  "Social": "You enjoy helping and teaching others. You value relationships and community.",
  "Enterprising": "You enjoy leading and persuading others. You like taking charge and organizing activities.",
  "Conventional": "You enjoy following rules and procedures. You prefer structured, organized work.",
  "Visual": "You learn best through visual information like charts, diagrams, and written text.",
  "Kinesthetic": "You learn best through hands-on activities and physical movement.",
  "Auditory": "You learn best through listening and discussing information.",
  "Reading": "You learn best through reading and reviewing detailed written materials.",
  "Hands-off": "You prefer mentors who give you space and independence to work things out.",
  "Structured": "You prefer mentors who provide regular guidance and check-ins.",
  "Collaborative": "You prefer mentors who work alongside you as teammates.",
  "Inspirational": "You prefer mentors who motivate you through stories and vision.",
  "Leadership": "You prefer to take charge and lead group activities.",
  "Support": "You prefer to support and encourage team members.",
  "Research": "You prefer to gather information and conduct research.",
  "Organization": "You prefer to organize materials and handle logistics.",
  "Experimental": "You prefer to try different approaches and learn through trial and error.",
  "Analytical": "You prefer to research and analyze before making decisions.",
  "Adaptive": "You prefer to make quick decisions and adapt as you go.",
  "Private": "You prefer feedback to be given privately and gently.",
  "Public": "You prefer feedback to be shared publicly to recognize your efforts.",
  "Detailed": "You prefer feedback to be specific and data-driven.",
  "Casual": "You prefer feedback to be shared during casual conversation.",
  "Recognition": "You are most motivated by recognition and praise from others.",
  "Money": "You are most motivated by earning money and financial rewards.",
  "ProblemSolving": "You are most motivated by solving problems and overcoming challenges.",
  "HelpingOthers": "You are most motivated by helping and supporting other people."
}